app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
 def main
 @post=Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Статья 1"], ["body", "Нечто"], ["created_at", "2022-12-29 19:06:47.732150"], ["updated_at", "2022-12-29 19:06:47.732150"]]
---
 def create
 @post=Post.new(par)
 if(@post.save)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "fg"], ["updated_at", "2022-12-29 18:37:40.616798"], ["id", 1]]
---
 def update
 @post=Post.find(params[:id])
 if(@post.update(par))